#Использовать "../src/1coverage"

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьПоискФайловXML");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьПоискФайловEDT");

	ИменаТестов.Добавить("ТестДолжен_ПроверитьФормированиеКэшаXML");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьФормированиеКэшаEDT");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьПоискФайловXML() Экспорт

	ПутьКИсходномуКоду = ОбъединитьПути(ПараметрыПриложения.КаталогПроекта, "tests", "fixtures", "cf-xml");

	МассивUUID = Новый Массив;
	МассивUUID.Добавить("f304fb62-52f8-44bc-acdb-d0bfd45a4028");
	МассивUUID.Добавить("04132787-f61a-41c5-b2fc-949ba4f6c45a");
	МассивUUID.Добавить("11111111-2222-3333-4444-555555555555");
	
	ОбработчикФайловКонфигурации = Новый ОбработчикФайловКонфигурации(ПутьКИсходномуКоду);
	ФайлыКонфигурации = ОбработчикФайловКонфигурации.НайтиФайлыКонфигурацииXML(МассивUUID);
	
	Ожидаем.Что(ФайлыКонфигурации.Количество()).Равно(2);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПоискФайловEDT() Экспорт

	ПутьКИсходномуКоду = ОбъединитьПути(ПараметрыПриложения.КаталогПроекта, "tests", "fixtures", "cf-edt");

	МассивUUID = Новый Массив;
	МассивUUID.Добавить("f304fb62-52f8-44bc-acdb-d0bfd45a4028");
	МассивUUID.Добавить("04132787-f61a-41c5-b2fc-949ba4f6c45a");
	МассивUUID.Добавить("11111111-2222-3333-4444-555555555555");
	
	ОбработчикФайловКонфигурации = Новый ОбработчикФайловКонфигурации(ПутьКИсходномуКоду);
	ФайлыКонфигурации = ОбработчикФайловКонфигурации.НайтиФайлыКонфигурацииEDT(МассивUUID);
	
	Ожидаем.Что(ФайлыКонфигурации.Количество()).Равно(2);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьФормированиеКэшаXML() Экспорт

	ПутьКИсходномуКоду = ОбъединитьПути(ПараметрыПриложения.КаталогПроекта, "tests", "fixtures", "cf-xml");

	МассивUUID = Новый Массив;
	МассивUUID.Добавить("f304fb62-52f8-44bc-acdb-d0bfd45a4028"); // РегистрНакопления1
	МассивUUID.Добавить("b7308561-8675-4a9c-bd27-30b65260e8db"); // Отчет1
	МассивUUID.Добавить("50c2fc3a-75fe-4bf9-a867-6f37bfda3c5c"); // Отчет1.ФормаОтчета
	МассивUUID.Добавить("864db1f0-53b5-4ecf-b266-6f4b4d966911"); // Документ1.Команда2
	МассивUUID.Добавить("7b8f569a-ce13-4061-b8cd-09502fd9c795"); // Справочник1.Команда1
	МассивUUID.Добавить("11111111-2222-3333-4444-555555555555");
	
	ОбработчикФайловКонфигурации = Новый ОбработчикФайловКонфигурации(ПутьКИсходномуКоду);
	ФайлыКонфигурации = ОбработчикФайловКонфигурации.НайтиФайлыКонфигурацииXML(МассивUUID);
	
	КэшКонфигурации = ОбработчикФайловКонфигурации.СформироватьКэшКонфигурацииXML(ФайлыКонфигурации);

	Ожидаем.Что(КэшКонфигурации.Количество()).Равно(8);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьФормированиеКэшаEDT() Экспорт

	ПутьКИсходномуКоду = ОбъединитьПути(ПараметрыПриложения.КаталогПроекта, "tests", "fixtures", "cf-edt");

	МассивUUID = Новый Массив;
	МассивUUID.Добавить("f304fb62-52f8-44bc-acdb-d0bfd45a4028"); // РегистрНакопления1
	МассивUUID.Добавить("b7308561-8675-4a9c-bd27-30b65260e8db"); // Отчет1
	МассивUUID.Добавить("50c2fc3a-75fe-4bf9-a867-6f37bfda3c5c"); // Отчет1.ФормаОтчета
	МассивUUID.Добавить("864db1f0-53b5-4ecf-b266-6f4b4d966911"); // Документ1.Команда2
	МассивUUID.Добавить("7b8f569a-ce13-4061-b8cd-09502fd9c795"); // Справочник1.Команда1
	МассивUUID.Добавить("11111111-2222-3333-4444-555555555555"); // Не существует
	
	ОбработчикФайловКонфигурации = Новый ОбработчикФайловКонфигурации(ПутьКИсходномуКоду);
	ФайлыКонфигурации = ОбработчикФайловКонфигурации.НайтиФайлыКонфигурацииEDT(МассивUUID);

	КэшКонфигурации = ОбработчикФайловКонфигурации.СформироватьКэшКонфигурацииEDT(ФайлыКонфигурации);

	Ожидаем.Что(КэшКонфигурации.Количество()).Равно(10);

КонецПроцедуры

Лог = ПараметрыПриложения.Лог();
