#Использовать "../src/1coverage/core/"
#Использовать tempfiles

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьОбъединениеИНормализациюЛогов");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьОбъединениеИНормализациюЛогов() Экспорт
	
	ПутьКЛогамПрокси = ОбъединитьПути(ПараметрыПриложения.КаталогПроекта, "tests", "fixtures", "dbgs-log");
	ВременныйКаталог = ВременныеФайлы.СоздатьКаталог();

	ОбработчикЛоговПрокси = Новый ОбработчикЛоговПрокси();
	ОбработчикЛоговПрокси.УстановитьПутьКЛогамПрокси(ПутьКЛогамПрокси);
	Результат = ОбработчикЛоговПрокси.ОбработатьЛоги();
	
	Ожидаем.Что(Результат, "Количество записей в логе не соответствует ожидаемому").ИмеетДлину(4);
	ДанныеЗамеров1 = Результат[0];
	Ожидаем.Что(ДанныеЗамеров1, "Количество модулей в данных замера не соответствует ожидаемому").ИмеетДлину(2);
	ДанныеЗамеров2 = Результат[1];
	Ожидаем.Что(ДанныеЗамеров2, "Количество модулей в данных замера не соответствует ожидаемому").ИмеетДлину(2);
	ДанныеЗамеров3 = Результат[2];
	Ожидаем.Что(ДанныеЗамеров3, "Количество модулей в данных замера не соответствует ожидаемому").ИмеетДлину(2);
	ДанныеЗамеров4 = Результат[3];
	Ожидаем.Что(ДанныеЗамеров4, "Количество модулей в данных замера не соответствует ожидаемому").ИмеетДлину(6);

	ВременныеФайлы.УдалитьФайл(ВременныйКаталог);

КонецПроцедуры

Лог = ПараметрыПриложения.Лог();
