#Использовать "../src/1coverage"
#Использовать tempfiles

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьОбъединениеИНормализациюЛогов");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьОбъединениеИНормализациюЛогов() Экспорт
	
	ПутьКЛогамПрокси = ОбъединитьПути(ПараметрыПриложения.КаталогПроекта, "tests", "fixtures", "dbgs-log");
	
	ОбработчикЛоговПрокси = Новый ОбработчикЛоговПрокси(ПутьКЛогамПрокси);
	ДанныеЗамеров = ОбработчикЛоговПрокси.ОбработатьЛоги();
	
	Ожидаем.Что(ДанныеЗамеров, "Количество записей данных замеров не соответствует ожидаемому").ИмеетДлину(6);

КонецПроцедуры

Лог = ПараметрыПриложения.Лог();
