#Использовать "../src/1coverage"
#Использовать tempfiles

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьОбъединениеИНормализациюЛогов");
	
	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьОбъединениеИНормализациюЛогов() Экспорт
	
	ПутьКЛогамПрокси = ОбъединитьПути(ПараметрыПриложения.КаталогПроекта, "tests", "fixtures", "dbgs-log");
	
	ОбработчикЛоговПрокси = Новый ОбработчикЛоговПрокси(ПутьКЛогамПрокси);
	Результат = ОбработчикЛоговПрокси.ОбработатьЛоги();
	
	Ожидаем.Что(Результат, "Количество записей в логе не соответствует ожидаемому").ИмеетДлину(4);
	ДанныеЗамеров1 = Результат[0];
	Ожидаем.Что(ДанныеЗамеров1, "Количество модулей в данных замера не соответствует ожидаемому").ИмеетДлину(2);
	Ожидаем.Что(ДанныеЗамеров1[0].moduleID.objectID._text, "").Равно("f304fb62-52f8-44bc-acdb-d0bfd45a4028");
	Ожидаем.Что(ДанныеЗамеров1[1].moduleID.objectID._text, "").Равно("04132787-f61a-41c5-b2fc-949ba4f6c45a");
	
	ДанныеЗамеров2 = Результат[1];
	Ожидаем.Что(ДанныеЗамеров2, "Количество модулей в данных замера не соответствует ожидаемому").ИмеетДлину(2);
	Ожидаем.Что(ДанныеЗамеров2.moduleID.objectID._text, "").Равно("07872757-43e2-4b3f-8a6a-2bf4b4e05462");

	ДанныеЗамеров3 = Результат[2];
	Ожидаем.Что(ДанныеЗамеров3, "Количество модулей в данных замера не соответствует ожидаемому").ИмеетДлину(2);
	Ожидаем.Что(ДанныеЗамеров3.moduleID.objectID._text, "").Равно("07872757-43e2-4b3f-8a6a-2bf4b4e05462");
	
	ДанныеЗамеров4 = Результат[3];
	Ожидаем.Что(ДанныеЗамеров4, "Количество модулей в данных замера не соответствует ожидаемому").ИмеетДлину(6);
	Ожидаем.Что(ДанныеЗамеров4[0].moduleID.objectID._text, "").Равно("50c2fc3a-75fe-4bf9-a867-6f37bfda3c5c");
	Ожидаем.Что(ДанныеЗамеров4[1].moduleID.objectID._text, "").Равно("b7308561-8675-4a9c-bd27-30b65260e8db");
	Ожидаем.Что(ДанныеЗамеров4[2].moduleID.objectID._text, "").Равно("b7308561-8675-4a9c-bd27-30b65260e8db");
	Ожидаем.Что(ДанныеЗамеров4[3].moduleID.objectID._text, "").Равно("4fcb6ccc-1fc4-44b0-89de-e91fd6840511");
	Ожидаем.Что(ДанныеЗамеров4[4].moduleID.objectID._text, "").Равно("8579e6d0-6ef5-4b64-8b17-7f666004b239");
	Ожидаем.Что(ДанныеЗамеров4[5].moduleID.objectID._text, "").Равно("1e2790f1-29a8-4f99-ae2d-625a683ec086");

КонецПроцедуры

Лог = ПараметрыПриложения.Лог();
